import streamlit as st
from menu import menu


def show_home():
    st.subheader('Опис проєкту')
    st.write(
        """
        Цей проєкт спрямований на розробку прогностичної моделі, яка дозволить передбачити ймовірність відтоку клієнтів 
        телекомунікаційної компанії, тобто визначити, які клієнти можуть припинити користування послугами компанії в майбутньому. 
        
        Це критично важливе завдання для телекомунікаційної компанії, оскільки відток клієнтів безпосередньо впливає на прибутковість бізнесу.
        
        У проєкті був проведений аналіз наданих даних, які містять інформацію про характеристики клієнтів,
        їх історію використання послуг, тарифні плани та інформацію про відтік клієнтів. Також була проведена передобробка даних, 
        що включає очищення даних, обробку пропущених значень та підготовку даних до машинного навчання.
        
        Після цього було проведено аналіз даних для виявлення основних факторів, що впливають на відток клієнтів. 
        Ці фактори були використані для створення прогностичної моделі, яка за допомогою методів машинного навчання зможе
        визначати ймовірність відтоку для кожного клієнта.
         
        На завершальному етапі модель була оцінена на предмет її точності та ефективності. Для зручного використання программа запакована у контейнер 
        для забезпечення відтворюваності результатів та інтеграції у робочий процес компанії.
        
        Цей проєкт дозволить компанії краще розуміти своїх клієнтів, передбачати можливі втрати та розробляти стратегії утримання клієнтів,
        що, в кінцевому рахунку, сприятиме зниженню відтоку та підвищенню прибутковості.
        """
    )


menu()
show_home()
